CSI API ETABS v1
cSapModel.GetProjectInfo Method
 Retrieves the project information data.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProjectInfo(
	ref int NumberItems,
	ref string[] Item,
	ref string[] Data
)
Function GetProjectInfo (
	ByRef NumberItems As Integer,
	ByRef Item As String(),
	ByRef Data As String()
) As Integer
Dim instance As cSapModel
Dim NumberItems As Integer
Dim Item As String()
Dim Data As String()
Dim returnValue As Integer
returnValue = instance.GetProjectInfo(NumberItems,
	Item, Data)
int GetProjectInfo(
	int% NumberItems,
	array<String^>^% Item,
	array<String^>^% Data
)
abstract GetProjectInfo :
        NumberItems : int byref *
        Item : string[] byref *
        Data : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
 The number of project info items returned.
Item
Type: System.String[]
 This is an array that includes the name of the project information item.
Data
Type: System.String[]
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
See Also
Reference
cSapModel Interface
ETABSv1 Namespace